In [9]:
#Import numpy and pandas
import numpy as np
import pandas as pd

In [4]:
#Load dataset
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [8]:
df_Analysis=df
print("Dataset")
df_Analysis

Dataset

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1.

In [10]:
#Prevent warning action from jupyter
pd.options.mode.chained_assignment=None

x,y=df_Analysis.FlightNumber.loc[[0]].values[0]+10, df_Analysis.FlightNumber.loc[[4]].values[0]-10

df_Analysis.FlightNumber.loc[[1]]=df_Analysis.FlightNumber.loc[[1]].fillna(x)
df_Analysis.FlightNumber.loc[[3]]=df_Analysis.FlightNumber.loc[[3]].fillna(x)

#Convert float to int
df_Analysis.FlightNumber=df_Analysis.FlightNumber.astype(int)

print("Output")
df_Analysis

Output

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10055          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2.

In [12]:
df_temp=df_Analysis.From_To.str.split('_',expand=True)
df_temp.columns=['From', 'To']

print("Output")
df_temp

Output

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3.

In [13]:
df_temp.From=df_temp.From.str.title()
df_temp.To=df_temp.To.str.title()
print("Output")
df_temp

Output

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4.

In [15]:
df_Analysis=df_Analysis.drop("From_To",axis=1).join(df_temp)
print("Output")
df_Analysis

Output

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10055          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London